#include "Detective.hpp"
#include<iostream>

void Act1() {
	std::cout << R"(
Детектив Майк Джонс сидел в своем кабинете и приводил в порядок бумаги, которые свидетельствовали о расследованном деле.
«Бюрократия»- подумал детектив. 
Внезапный стук в дверь прервал его мысли.
Майк Джонс: Войдите.
В кабинет вошла женщина с бледным лицом и красными, опухшими глазами, одетая в черный строгий костюм.
Женщина: Добрый день, детектив Майк Джонс. Верно?
Майк Джонс: Приветствую. Верно, присаживайтесь.
Женщина: Меня зовут Мишель Юстансон.
Майк Джонс: Что Вас привело ко мне, миссис Юстансон?
Мишель Юстансон: Детектив Джонс… моя дочь, Эстер, пропала.
Майк Джонс: Миссис Юстансон, я понимаю ваше волнение. Расскажите подробнее.
Мишель Юстансон: Эстер пропала уже две недели. Полиция прочесывала город, завод… 
Майк Джонс: Продолжайте.
Мишель: Это не просто пропажа! Я уверена, что ее похитили. 
Майк Джонс: Миссис Юстансон, почему Вы так думаете? Кто мог быть заинтересован в похищении Эстер?
Мишель Юстансон: Я... Я не знаю. Но Бьерн... мой муж, он был... он боялся кого-то, закрывался в кабинете, делал странные звонки. Я не знаю, кто мог угрожать ему.
Майк Джонс: Вы говорите о вашем муже, Бьерне Юстансоне? Расскажите о нем.
Мишель Юстансон: Он директор металлургического завода в небольшом городке недалеко - Стальпорт. 
Майк Джонс: Миссис Юстансон, что именно Вам показалось подозрительным в вашем муже?
Мишель Юстансон: Я думаю, что он что-то скрывал. Он не хотел, чтобы Эстер узнала о его делах, она была его светлым лучиком. Она училась в Карни и подавала такие надежны. Даже с нашим достатком, мы старались воспитать из нее человека совести.
Майк Джонс: Я понимаю. Миссис Юстансон, скажите мне все, что знаете о бизнесе вашего мужа, о его связях. 
Мишель Юстансон: Я не знаю, с кем он заключал сделки. Но он постоянно говорил о "неудачных вложениях", о "рисках", о "долгах". Он боялся за нас с Эстер, постоянно говорил, что нам нужно быть осторожнее.
Майк Джонс: Я понял, миссис Юстансон. Понимаю, что сейчас вам трудно, но нужна ваша помощь, чтобы найти Эстер. Вы можете сказать, где она была в последний раз, что она делала? 
Мишель Юстансон: Она была дома. Я попросила ее прогуляться со мной, но она болтала с подругами из Карни по видеосвязи. Я ушла на прогулку одна и больше не заходила к ней. А на утро мы с Бьерном не могли найти ее и не дозвонились.
Майк Джонс: Миссис Юстансон, я помогу вам найти Эстер.
Мишель Юстансон: Детектив Джонс, прошу вас, найдите ее.)";
	std::cout << "\n";
}